class TestHtml {
  String texttest = """
 <h1>تعقیبات مخصوص نماز صبح:</h1>
    <ul>
        <li>
            <h2>استغفار:</h2>
            <blockquote>ابن بابویه به سند معتبر از امام محمد باقر علیه‌السلام روایت کرده است که:</blockquote>
            <p>«هر کس بعد از نماز صبح هفتاد مرتبه بگوید: <br>
            <strong>اَسْتَغْفِرُ اللَّهَ رَبّى‏ وَ أَتُوبُ إِلَيْهِ</strong> <br>
            خداوند او را می‌آمرزد، هرچند در آن روز هفتاد هزار گناه کرده باشد.» <br>
            و به روایت دیگر: «هفتصد گناه.»</p>
        </li>
        <li>
            <h2>سوره توحید:</h2>
            <blockquote>ابن بابویه به سند صحیح از حضرت امیرالمؤمنین علیه‌السلام روایت کرده است که:</blockquote>
            <p>«هر کس بعد از نماز صبح یازده مرتبه سوره <strong>قُلْ هُوَ اللَّهُ أَحَدٌ</strong> بخواند، در آن روز گناهی بر او نوشته نمی‌شود، به‌رغم بینی شیطان.»</p>
            <blockquote>و در بلدالأمین از حضرت رسول صلی‌الله‌علیه‌وآله روایت شده که:</blockquote>
            <p>«هر کس سوره <strong>قُلْ هُوَ اللَّهُ أَحَدٌ</strong> را هر روز ده مرتبه بخواند، در آن روز، هرچند شیطان تلاش کند، گناهی بر او نوشته نمی‌شود.»</p>
        </li>
        <li>
            <h2>ذکر ماشآءالله:</h2>
            <blockquote>کلینی به سند صحیح از حضرت صادق علیه‌السلام روایت کرده است که:</blockquote>
            <p>«هر کس بعد از نماز صبح صد مرتبه بگوید: <br>
            <strong>ماشَآءَاللَّهُ كانَ وَلاحَوْلَ وَلاقُوَّةَ إِلاَّ بِاللَّهِ الْعَلِىِّ الْعَظِيمِ</strong> <br>
            در آن روز هیچ مکروهی نبیند.»</p>
        </li>
        <li>
            <h2>سوره قدر:</h2>
            <blockquote>کفعمی و دیگران از حضرت امام محمد باقر علیه‌السلام روایت کرده‌اند که:</blockquote>
            <p>«هر کس سوره <strong>إِنَّا أَنْزَلْناهُ</strong> را بعد از صبح ده مرتبه، نزدیک زوال خورشید ده مرتبه، و بعد از عصر ده مرتبه بخواند، دو هزار کاتب را به مدت سی سال به زحمت اندازد.»</p>
            <blockquote>و نیز از آن حضرت روایت است که:</blockquote>
            <p>«هر کس آن را هفت مرتبه بعد از طلوع فجر بخواند، هفتاد صف از ملائکه، هفتاد صلوات بر او بفرستند و هفتاد بار بر او رحمت آورند.»</p>
            <blockquote>و از امام محمد تقی علیه‌السلام روایت شده است که:</blockquote>
            <p>«کسی که سوره <strong>إِنَّا أَنْزَلْناهُ</strong> را در شبانه‌روز هفتاد و شش مرتبه بخواند، خداوند هزار ملک برای او خلق می‌کند که در سی و شش هزار سال، ثواب آن را برای او بنویسند.»</p>
            <p><strong>نحوه‌ی تقسیم دفعات:</strong><br>
            بعد از طلوع صبح پیش از نماز صبح: ۷ مرتبه<br>
            بعد از نماز صبح: ۱۰ مرتبه<br>
            بعد از زوال خورشید پیش از نافله: ۱۰ مرتبه<br>
            بعد از نوافل زوال: ۲۱ مرتبه<br>
            بعد از نماز عصر: ۱۰ مرتبه<br>
            بعد از نماز عشاء: ۷ مرتبه<br>
            هنگام خواب: ۱۱ مرتبه</p>
        </li>
        <li>
            <h2>ذکر سبحان الله:</h2>
            <blockquote>ابن بابویه و دیگر علما از حضرت امام محمد باقر علیه‌السلام روایت کرده‌اند که حضرت رسول صلی‌الله‌علیه‌وآله فرمودند:</blockquote>
            <p>«هر کس بعد از نماز صبح ده مرتبه بگوید: <br>
            <strong>سُبْحانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ وَلاحَوْلَ وَلاقُوَّةَ إِلاَّ بِاللَّهِ الْعَلِىِّ الْعَظِيمِ</strong> <br>
            خداوند او را از نابینایی، دیوانگی، خوره، پریشانی و خطرات ناگوار حفظ می‌کند.»</p>
        </li>
        <li>
            <h2>اذکار سبحان الله، الحمدلله، لا اله الا الله، الله اکبر:</h2>
            <blockquote>حضرت رسول صلی‌الله‌علیه‌وآله فرمودند:</blockquote>
            <p>«هر کس هر بامداد و شام این اذکار را سه مرتبه بگوید، خداوند اجلش را به تأخیر اندازد، بر دشمنانش یاری دهد و از مرگ‌های بد حفظ کند:</p>
            <p><strong>
            سُبْحانَ اللَّهِ مِلْءَ الْمِيزانِ وَمُنْتَهَى الْعِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ الْعَرْشِ وَسَعَةَ الْكُرْسِيِّ<br>
            الْحَمْدُ لِلَّهِ مِلْءَ الْمِيزانِ وَمُنْتَهَى الْعِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ الْعَرْشِ وَسَعَةَ الْكُرْسِيِّ<br>
            لا إِلَهَ إِلَّا اللَّهُ مِلْءَ الْمِيزانِ وَمُنْتَهَى الْعِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ الْعَرْشِ وَسَعَةَ الْكُرْسِيِّ<br>
            اللَّهُ أَكْبَرُ مِلْءَ الْمِيزانِ وَمُنْتَهَى الْعِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ الْعَرْشِ وَسَعَةَ الْكُرْسِيِّ</strong></p>
        </li>
        <li>
            <h2>بسم الله و لا حول و لا قوة:</h2>
            <blockquote>حضرت امام رضا علیه‌السلام فرمودند:</blockquote>
            <p>«هر کس بعد از نماز صبح صد مرتبه بگوید: <br>
            <strong>بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ لا حَوْلَ وَلا قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِىِّ الْعَظِيمِ</strong> <br>
            به اسم اعظم خداوند نزدیک‌تر است از سیاهی چشم به سفیدی آن.»</p>
        </li>
        <li>
            <h2>دعای رزق:</h2>
            <blockquote>حضرت امام موسی کاظم علیه‌السلام فرمودند:</blockquote>
            <p>«هر کس بعد از نماز صبح ده مرتبه بگوید: <br>
            <strong>سُبْحانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَأَسْأَلُهُ مِنْ فَضْلِهِ</strong> <br>
            رزق و کار او گشوده می‌شود.»</p>
        </li>
        <li>
            <h2>دعای توکل و رفع فقر:</h2>
            <blockquote>حضرت صادق علیه‌السلام فرمودند:</blockquote>
            <p>«بعد از نماز صبح بگو:</p>
            <p><strong>
            تَوَكَّلْتُ عَلَى الْحَيِّ الْقَيُّومِ الَّذِى لا يَمُوتُ وَالْحَمْدُ لِلَّهِ الَّذِى لَمْ يَتَّخِذْ وَلَداً وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِى الْمُلْكِ وَلَمْ يَكُنْ لَهُ وَلِىٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيراً<br>
            اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْبُؤْسِ وَالْفَقْرِ وَمِنْ غَلَبَةِ الدَّيْنِ وَالسُّقْمِ وَأَسْأَلُكَ أَنْ تُعِينَنِى عَلَى أَدَاءِ حَقِّكَ إِلَيْكَ وَإِلَى النَّاسِ</strong></p>
        </li>
    </ul>
    <p><strong>پایان تعقیبات مخصوص نماز صبح.</strong></p>



  """;
}
